rails/app/controllers/todoo_controller.rb

INSERT INTO "todos" ("created_at", "done", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-09-05 16:52:56.357225"], ["done", "f"], ["name", "Another todoo"], ["updated_at", "2015-09-05 16:52:56.357225"], ["user_id", 1]]
---
  def create
    @todo=Todo.new(todo_params)
    if @todo.save

SELECT  "todos".* FROM "todos"  WHERE "todos"."id" = ? LIMIT 1  [["id", 93]]
UPDATE "todos" SET "done" = ?, "updated_at" = ? WHERE "todos"."id" = 93  [["done", "t"], ["updated_at", "2015-09-12 06:11:33.325610"]]
---
  def update
    @todo=Todo.find(params[:id])

    if @todo.update_attribute(:done, true)