rails/app/controllers/tokens_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'akkhil' LIMIT 1
---
  def verify
    @user = User.find_by(username: params[:user][:username])

SELECT  "users".* FROM "users"  WHERE "users"."access_token" = '9240e72825114419ab8cc38e64c7d571' LIMIT 1
---
  def verify_token
      @user = User.find_by(access_token: params[:token])