rails/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save!
---
INSERT INTO "users" ("access_token", "created_at", "email", "encrypted_password", "first_name", "last_name", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)